---
title: CableTraySizes
classe: Autodesk.Revit.DB.Electrical.CableTraySizes
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# CableTraySizes

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Void AddSize(MEPSize)` | `cableTraySizes.AddSize(sizeInfo)` | Void |
| `Void ClearAll()` | `cableTraySizes.ClearAll()` | Void |
| `Boolean Contains(Double)` | `cableTraySizes.Contains(nominalDiameter)` | Boolean |
| `CableTraySizes GetCableTraySizes(Document)` | `CableTraySizes.GetCableTraySizes(aDoc)` | CableTraySizes |
| `CableTraySizeIterator GetCableTraySizesIterator()` | `cableTraySizes.GetCableTraySizesIterator()` | CableTraySizeIterator |
| `IEnumerator<MEPSize> GetEnumerator()` | `cableTraySizes.GetEnumerator()` | IEnumerator<MEPSize> |
| `Int32 GetSizeCount()` | `cableTraySizes.GetSizeCount()` | Int32 |
| `Void RemoveSize(MEPSize)` | `cableTraySizes.RemoveSize(sizeInfo)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```